EDT/УТ/src/DataProcessors/ВыгрузкаДанныхВБухгалтерию/ВыгрузкаДанныхВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаДанныхВБухгалтерию</name>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/ВыгрузкаДанныхВБухгалтерию/ВыгрузкаДанныхВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВыгрузкаДанныхВБухгалтерию</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПланВыгрузки</name>
    <type>
      <types>CatalogRef.ПланыВыгрузкиДанныхВБухгалтерию</types>
    </type>
  </resources>
  <resources>
    <name>СуммаТерминал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНаличные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокументаПоступления</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокументаПКО</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторДокументаОтчетОРозничнойПродаже</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторОперацииВведеннойВручную</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ПараметрыКонтрагентов/ПараметрыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыКонтрагентов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретСменыОплаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяОжиданияПриЗабореТовара</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВычисляемыйЗапретЧастичногоВыкупа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПриёмИтогоСКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъёма</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ЗапретУстановкиСуммыПодъемаВодителюБольшеВыставленной</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытиеЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВесЗапросаДанныхОПодъемеОтВодителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОперативнаяПриемка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОперативнойПриемки</name>
    <type>
      <types>EnumRef.ТипыОперативнойПриемки</types>
    </type>
  </resources>
  <resources>
    <name>УчетЗаказовПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетШКПоТоварам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СкладскаяОбработкаОтсутствует</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АгрегироватьДанныеВОтправляемыхОтчетах</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СвязкаНастройкиПечатиЧеков</name>
    <type>
      <types>CatalogRef.СвязкиККМ</types>
    </type>
  </resources>
  <resources>
    <name>СпособыКонтроляДнейЗадолженности</name>
    <type>
      <types>EnumRef.СпособыКонтроляДнейЗадолженности</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейДоПросрочкиДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоАгрегатор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Спецсчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипОтношенийСКлиентами</name>
    <type>
      <types>EnumRef.ВариантыПечатиОтчетовАгента</types>
    </type>
  </resources>
  <resources>
    <name>setiingId_Strizh</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>login_Strizh</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>password_Strizh</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчетТоваровПоМестам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечатьПредоплаченныхЧеков</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеИсключениеМестЗаказаПриПогрузкеВАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКодИдентификацииКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НазначениеКодаИдентификацииКлиентаИССтрижа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическоеИсключениеЧастичноПринятыхНаСкладЗаказовПриПогрузкеВАвто</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеСоздаватьМестаЗаказовПоПриходнымАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОбновлятьКоличествоМестЗаказовПриВыгрузкеАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОдинаковыеШКНаВсехМестахЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтключитьПроверкуБНЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифПримерки</name>
    <type>
      <types>CatalogRef.ТарифыПримерка</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаСсылкиЛКПолучателяЗаказаНаEmail</name>
    <type>
      <types>EnumRef.ВариантыОтправкиСсылокЛКПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ОтправкаСсылкиЛКПолучателяЗаказаSMS</name>
    <type>
      <types>EnumRef.ВариантыОтправкиСсылокЛКПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонSMSОтправкиСсылкиЛКПолучателяЗаказа</name>
    <type>
      <types>CatalogRef.ШаблоныСМСРассылок</types>
    </type>
  </resources>
  <resources>
    <name>СопроводительныеДокументыНаходятсяВКоробке</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>БезусловнаяПечатьБланковЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>accessKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛьготнаяКатегорияЭквайринга</name>
    <type>
      <types>CatalogRef.ЛьготныеКатегорииЭквайринга</types>
    </type>
  </resources>
  <resources>
    <name>ПроизводитьРассылкуКонтроляЗаказов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ФормироватьАПП</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяФормированияАПП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОператорРассылки</name>
    <type>
      <types>CatalogRef.ОператорыСМСРассылки</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ПланыВыгрузкиДанныхВБухгалтерию/ПланыВыгрузкиДанныхВБухгалтерию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыВыгрузкиДанныхВБухгалтерию</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИсточникДанных</name>
    <type>
      <types>CatalogRef.ИсточникиДанныхБазы1С</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецсчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПоступлениеТоваров</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПКО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОтчетОРозничныхПродажах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьОперациюВведеннуюВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаТоваров</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКассы</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаПоступления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаПКО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДокументаОтчетОРозничныхПродажах</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОперацииВведеннойВручную</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПланАктивен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьОбъектыБухгалтерииПриОткрытии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтатьиДДС</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеСтатьиДДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаВзаиморасчетов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаНДС</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияДляНаличныхРасчетовИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавлятьСкладВПроводку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменМеждуСвоимиЮрлицами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТипыОплат</name>
    <attributes>
      <name>ТипОплаты</name>
      <type>
        <types>CatalogRef.ТипыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ТоварПривязанККонтрагенту</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТовара</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторТипаОплаты</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеТипаОплаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/ВыгрузкаДанныхВБухгалтерию/Forms/Форма/Module.bsl
&НаСервере
Процедура ПолучитьДанныеВыгрузкиНаСервере()
	
	ИтогоНаличные = 0;
	ИтогоТерминал = 0;	
	
	ДанныеВыгрузки = РеквизитФормыВЗначение("ДеревоДанных");
	ДанныеВыгрузки.Строки.Очистить();
	ДанныеПоЛогистике.Очистить();
	 
	ОбъектОбработки = РеквизитФормыВЗначение("Объект"); 
	
	Если ПоОтчетуКассира Тогда
		ТаблицаДанных = Обработки.ВыгрузкаДанныхВБухгалтерию.ПолучитьДанныеВыгрузкиПоОтчету(ДатаВыгрузки, Истина);
	Иначе
		ТаблицаДанных = Обработки.ВыгрузкаДанныхВБухгалтерию.ПолучитьДанныеВыгрузки(ДатаВыгрузки, Истина, ОбъектОбработки.ПолучитьМакет("ДанныеПоОтчетКассира"));
	КонецЕсли;
	
	ТаблицаПартнеров = ТаблицаДанных.Скопировать();
	
	ТаблицаПартнеров.Свернуть("Партнер, Организация, Спецсчет, ПланВыгрузки, ДатаВыгрузки","СуммаНаличные, СуммаТерминал");
	
	Для Каждого СтрокаДанных Из ТаблицаПартнеров Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаДанных.Организация) Тогда // Организация по договору не определена
			
			ДанныеВыгрузки.Строки.Очистить();

			ВызватьИсключение "Для " + СокрЛП(СтрокаДанных.Партнер) + " (" + СокрЛП(СтрокаДанных.Партнер.Код) + ") не удалось определить организацию по договору!";			
			
		КонецЕсли;	
		
		СтрокаДерева1 = ДанныеВыгрузки.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДерева1, СтрокаДанных);
		СтрокаДерева1.ПартнерЗаказ = СтрокаДанных.Партнер;
		СтрокаДерева1.Уровень = 1;
		
		ИтогоНаличные = ИтогоНаличные +  СтрокаДерева1.СуммаНаличные;
		ИтогоТерминал = ИтогоТерминал +  СтрокаДерева1.СуммаТерминал;
		
		ТаблицаДокументов = ТаблицаДанных.НайтиСтроки(Новый Структура("Партнер", СтрокаДанных.Партнер));
		Для Каждого СтрокаДокументов Из ТаблицаДокументов Цикл
			
			СтрокаДерева2 = СтрокаДерева1.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева2, СтрокаДокументов,,"Организация, Спецсчет, ПланВыгрузки");
			СтрокаДерева2.ПартнерЗаказ = СтрокаДокументов.Заказ;
			СтрокаДерева2.Уровень = 2;
			//СтрокаДерева2.ТерминалДоставки = СтрокаДерева2.ПартнерЗаказ.ТерминалДоставки;
		КонецЦикла;	
	КонецЦикла;
	
	//Подготовка данных по логистике
	СтрокиКопирования = ТаблицаДанных.НайтиСтроки(Новый Структура("Спецсчет",Ложь)); //Исключаем все Спецсчет=Истина
	
	ТаблицаЛогистики = ТаблицаДанных.Скопировать(СтрокиКопирования);
	ТаблицаЛогистики.Свернуть("Организация, ТерминалДоставки" ,"СуммаНаличные, СуммаТерминал");
	
	//КомпанияЛогистики = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7722404333");
	//КомпанияЛогистики = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7722478416");
	
	//CeHbKA 22.03.2021
	//с 24.03.2021 смена организации выгрузки на ООО "Глобал Логистик" 
	//КомпанияЛогистики = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7720645220");	
	//CeHbKA 22.03.2021
	//с 21.12.2022 смена организации выгрузки на ООО "Время Логистики" 
	КомпанияЛогистики = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728034548");	
	
	ПланВыгрузки = Неопределено;	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыгрузкиДанныхВБухгалтерию.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПланыВыгрузкиДанныхВБухгалтерию КАК ПланыВыгрузкиДанныхВБухгалтерию
		|ГДЕ
		|	ПланыВыгрузкиДанныхВБухгалтерию.ПланАктивен
		|	И ПланыВыгрузкиДанныхВБухгалтерию.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", КомпанияЛогистики);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();	
	Если РезультатЗапроса.Следующий() Тогда
		ПланВыгрузки = РезультатЗапроса.Ссылка;
	КонецЕсли;
	
	КолонкаСпецсчет = ТаблицаЛогистики.Колонки.Добавить("Спецсчет", Новый ОписаниеТипов("Булево"));
	КолонкаПланВыгрузки = ТаблицаЛогистики.Колонки.Добавить("ПланВыгрузки", Новый ОписаниеТипов("СправочникСсылка.ПланыВыгрузкиДанныхВБухгалтерию"));
	КолонкаДатаВыгрузки = ТаблицаЛогистики.Колонки.Добавить("ДатаВыгрузки", Новый ОписаниеТипов("Дата"));
	
	КолонкаПартнер = ТаблицаЛогистики.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));

	Для Каждого СтрокаДанных Из ТаблицаЛогистики Цикл
		
		СтрокаДанных.Партнер = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", СтрокаДанных.Организация.ИНН);
		СтрокаДанных.Спецсчет = СпецСчетКонтрагента(СтрокаДанных.Партнер, ДатаВыгрузки);

	КонецЦикла;			
	//КолонкаОрганизация = ТаблицаЛогистики.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаЛогистики.ЗаполнитьЗначения(КомпанияЛогистики, "Организация");
	ТаблицаЛогистики.ЗаполнитьЗначения(ПланВыгрузки, "ПланВыгрузки");
	ТаблицаЛогистики.Сортировать("Партнер");
	
	Для Каждого СтрокаЛогистики Из ТаблицаЛогистики Цикл
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыгрузкаДанныхВБухгалтериюСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ВыгрузкаДанныхВБухгалтерию.СрезПоследних КАК ВыгрузкаДанныхВБухгалтериюСрезПоследних
		|ГДЕ
		|	ВыгрузкаДанныхВБухгалтериюСрезПоследних.Партнер = &Партнер
		|	И ВыгрузкаДанныхВБухгалтериюСрезПоследних.ТерминалДоставки = &ТерминалДоставки
		|	И ВыгрузкаДанныхВБухгалтериюСрезПоследних.ПланВыгрузки = &ПланВыгрузки
		|	И ВыгрузкаДанныхВБухгалтериюСрезПоследних.ДатаВыгрузки = &ДатаВыгрузки";
		
		Запрос.УстановитьПараметр("ДатаВыгрузки", ДатаВыгрузки);
		Запрос.УстановитьПараметр("Партнер", СтрокаЛогистики.Партнер);
		Запрос.УстановитьПараметр("ПланВыгрузки", СтрокаЛогистики.ПланВыгрузки);
		Запрос.УстановитьПараметр("ТерминалДоставки", СтрокаЛогистики.ТерминалДоставки);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Следующий() Тогда
			СтрокаЛогистики.ДатаВыгрузки = РезультатЗапроса.Период;
		Конецесли;
		
	КонецЦикла;	
	
	
	ИтогоНаличныеЛогистика = ТаблицаЛогистики.Итог("СуммаНаличные");
	ИтогоТерминалЛогистика = ТаблицаЛогистики.Итог("СуммаТерминал");
	//Подготовка данных по логистике	
	
	ДанныеПоЛогистике.Загрузить(ТаблицаЛогистики);
	
	ЗначениеВРеквизитФормы(ДанныеВыгрузки, "ДеревоДанных");
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеВыгрузки(Команда)
	ПолучитьДанныеВыгрузкиНаСервере();
КонецПроцедуры

&НаСервере
Функция ВыгрузитьДанныеВБухгалтериюНаСервере(ОшибкиВыгрузки = "")
	
	//"Организация, ИсточникДанных, Партнер, ПланВыгрузки, Спецсчет, СуммаНаличные, СуммаТерминал, ТерминалДоставки"
	
	ТаблицаОплат = Новый ТаблицаЗначений;
	ТаблицаОплат.Колонки.Добавить("Партнер",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаОплат.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаОплат.Колонки.Добавить("Спецсчет",Новый ОписаниеТипов("Булево"));
	ТаблицаОплат.Колонки.Добавить("СуммаНаличные",Новый ОписаниеТипов("Число"));
	ТаблицаОплат.Колонки.Добавить("СуммаТерминал",Новый ОписаниеТипов("Число"));
	ТаблицаОплат.Колонки.Добавить("ПланВыгрузки", Новый ОписаниеТипов("СправочникСсылка.ПланыВыгрузкиДанныхВБухгалтерию"));
	ТаблицаОплат.Колонки.Добавить("ТерминалДоставки", Новый ОписаниеТипов("СправочникСсылка.РегиональныеТерминалы"));
	ТаблицаОплат.Колонки.Добавить("ИсточникДанных", Новый Описаниетипов("СправочникСсылка.ИсточникиДанныхБазы1С"));
	
	СтрокиДерева = ДеревоДанных.ПолучитьЭлементы();
	Для Каждого СтрокаДанных Из СтрокиДерева Цикл
		
		Если Не СтрокаДанных.Выгружать Тогда Продолжить КонецЕсли;
		
		СтрокаОплаты = ТаблицаОплат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОплаты, СтрокаДанных);
		СтрокаОплаты.Партнер = СтрокаДанных.ПартнерЗаказ;
		СтрокаОплаты.ИсточникДанных = СтрокаОплаты.ПланВыгрузки.ИсточникДанных;
		СтрокаОплаты.ТерминалДоставки = Справочники.РегиональныеТерминалы.ПустаяСсылка();
		
		СтрокаДанных.ДатаВыгрузки = Текущаядата();
		
	КонецЦикла;	
	
	Если ТаблицаОплат.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для выгрузки.");
		Возврат Ложь;
		
	КонецЕсли;	
	
	ВыгрузкаВБухгалтериюСервер.ВыгрузитьДокументы(ТаблицаОплат, ДатаВыгрузки, ОшибкиВыгрузки);
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеВБухгалтерию(Команда)
	
	Состояние("Выполняется обработка данных...");
	
	ОшибкиВыгрузки = "";
	Если ВыгрузитьДанныеВБухгалтериюНаСервере(ОшибкиВыгрузки) Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиВыгрузки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка завершена.");
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоДанныхПриАктивизацииСтроки(Элемент)
	Если Элементы.ДеревоДанных.ТекущиеДанные = Неопределено Тогда Возврат КонецЕсли;
	
	Если Элементы.ДеревоДанных.ТекущиеДанные.Уровень = 2 Тогда
		Элементы.ДеревоДанныхВыгружать.ТолькоПросмотр = Истина;
	Иначе
		Элементы.ДеревоДанныхВыгружать.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВключитьВсе(Команда)
	СтрокиДерева = ДеревоДанных.ПолучитьЭлементы();
	Для Каждого СтрокаДанных Из СтрокиДерева Цикл
		СтрокаДанных.Выгружать = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьВсе(Команда)
	СтрокиДерева = ДеревоДанных.ПолучитьЭлементы();
	Для Каждого СтрокаДанных Из СтрокиДерева Цикл
		СтрокаДанных.Выгружать = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДанныеПоВыгрузке(Команда)
	
	МассивОтбораПартнеров = Новый Массив;
	СтрокиДерева = ДеревоДанных.ПолучитьЭлементы();
	Для Каждого СтрокаДанных Из СтрокиДерева Цикл
		Если СтрокаДанных.Выгружать Тогда
			МассивОтбораПартнеров.Добавить(СтрокаДанных.ПартнерЗаказ);
		КонецЕсли;
	КонецЦикла;	
	
	
	ПараметрыПросмотраРегистра = НОвый Структура();
	Если МассивОтбораПартнеров.Количество() > 0 Тогда
		 //ПараметрыПросмотраРегистра.Вставить("Отбор", Новый Структура("Партнер", МассивОтбораПартнеров));
		 
		 СпиокПартнеров = Новый СписокЗначений;
		 СпиокПартнеров.ЗагрузитьЗначения(МассивОтбораПартнеров);
		 
		 фиксНастройки = Новый НастройкиКомпоновкиДанных;
		 
		 эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
		 эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		 эОтбор.ПравоеЗначение = СпиокПартнеров;
		 эОтбор.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;
		 эОтбор.Использование = Истина;
		 
		 эОтбор = фиксНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		 эОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДатаВыгрузки");
		 эОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		 эОтбор.ПравоеЗначение = НачалоДня(ДатаВыгрузки);
		 эОтбор.Применение = ТипПримененияОтбораКомпоновкиДанных.Элементы;
		 эОтбор.Использование = Истина;
		 
		 ПараметрыПросмотраРегистра.Вставить("ФиксированныеНастройки", фиксНастройки);
		 
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.ВыгрузкаДанныхВБухгалтерию.ФормаСписка", ПараметрыПросмотраРегистра);
	
КонецПроцедуры              

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаВыгрузки = ТекущаяДата() - (5*24*60*60);
	ПоОтчетуКассира = Истина;
КонецПроцедуры

&НаСервере
Процедура ДатаВыгрузкиПриИзмененииНаСервере()
	
	ДанныеВыгрузки = РеквизитФормыВЗначение("ДеревоДанных");
	ДанныеВыгрузки.Строки.Очистить();
	ЗначениеВРеквизитФормы(ДанныеВыгрузки, "ДеревоДанных");
	
	ИтогоНаличные = 0;
	ИтогоТерминал = 0;
	ИтогоНаличныеЛогистика = 0;
	ИтогоТерминалЛогистика = 0;

	ДанныеПоЛогистике.Очистить();

КонецПроцедуры

&НаКлиенте
Процедура ДатаВыгрузкиПриИзменении(Элемент)
	
	ДатаВыгрузкиПриИзмененииНаСервере()

КонецПроцедуры

&НаСервере
Функция ВыгрузитьДанныеЛогистикиНаСервере(ОшибкиВыгрузки = "")
	//"Организация, ИсточникДанных, Партнер, ПланВыгрузки, Спецсчет, СуммаНаличные, СуммаТерминал, ТерминалДоставки"
	
	ТаблицаОплат = Новый ТаблицаЗначений;
	ТаблицаОплат.Колонки.Добавить("Партнер",Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаОплат.Колонки.Добавить("Организация",Новый ОписаниеТипов("СправочникСсылка.Организации"));
	ТаблицаОплат.Колонки.Добавить("Спецсчет",Новый ОписаниеТипов("Булево"));
	ТаблицаОплат.Колонки.Добавить("СуммаНаличные",Новый ОписаниеТипов("Число"));
	ТаблицаОплат.Колонки.Добавить("СуммаТерминал",Новый ОписаниеТипов("Число"));
	ТаблицаОплат.Колонки.Добавить("ПланВыгрузки", Новый ОписаниеТипов("СправочникСсылка.ПланыВыгрузкиДанныхВБухгалтерию"));
	ТаблицаОплат.Колонки.Добавить("ТерминалДоставки", Новый ОписаниеТипов("СправочникСсылка.РегиональныеТерминалы"));
	ТаблицаОплат.Колонки.Добавить("ИсточникДанных", Новый Описаниетипов("СправочникСсылка.ИсточникиДанныхБазы1С"));
	
	Для Каждого СтрокаДанных Из ДанныеПоЛогистике Цикл
		
		СтрокаОплаты = ТаблицаОплат.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОплаты, СтрокаДанных);
		СтрокаОплаты.ИсточникДанных = СтрокаОплаты.ПланВыгрузки.ИсточникДанных;		
		СтрокаДанных.ДатаВыгрузки = Текущаядата();
		
	КонецЦикла;	
	
	Если ТаблицаОплат.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет данных для выгрузки.");
		Возврат Ложь;
		
	КонецЕсли;	
	
	ВыгрузкаВБухгалтериюСервер.ВыгрузитьДокументы(ТаблицаОплат, ДатаВыгрузки, ОшибкиВыгрузки);
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеЛогистики(Команда)
		Состояние("Выполняется обработка данных...");
	
	ОшибкиВыгрузки = "";
	Если ВыгрузитьДанныеЛогистикиНаСервере(ОшибкиВыгрузки) Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОшибкиВыгрузки);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка завершена.");
	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СпецСчетКонтрагента(Контрагент, ДатаВыборки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПараметрыКонтрагентовСрезПоследних.Спецсчет КАК Спецсчет
	|ИЗ
	|	РегистрСведений.ПараметрыКонтрагентов.СрезПоследних(&Дата, Контрагент = &Контрагент) КАК ПараметрыКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ДатаВыборки);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() тогда
		Возврат ВыборкаДетальныеЗаписи.Спецсчет;
	КонецЕсли;
	
	Возврат Ложь;
	
Конецфункции
